<?php
include("header.php");
?>
<div class="container-fluid">
    <div class="row">    
        <div class="col-md-9">
            <div class="page-header">
                <h2>രാജാസ് ഹൈസ്കൂളിന്റെ ചരിത്രം</h2>
            </div>
            <p style="text-align:justify;">
            കോട്ടക്കലിന്റെ സാംസ്കാരിക ചരിത്രത്തെ സമ്പന്നമാക്കിയ സ്ഥാപനമാണ് രാജാസ് ഹൈസ്കൂള്‍. കോട്ടക്കല്‍ കോവിലകമാണ് ഇത് സ്ഥാപിച്ചത്. ഇതിന്റെ സ്ഥാപകന്‍ എം.കെ വള്ളോടിയ‌ുടെ അച്ഛന്‍ മാനവേദന്‍ രാജാ ആയിരുന്നു. 44ഏക്കര്‍ വിസ്‌തൃതിയ‌ുള്ള വലിയ കോമ്പൗണ്ടിലാണ് സ്‌ക്ക‌ൂള്‍ സ്ഥാപിച്ചത് . കോട്ടക്കലില്‍ ഹൈസ്കൂള്‍. വിദ്യാഭ്യാസ പ്രവര്‍ത്തനങ്ങള‌ുടെ ചരിത്രം ആരംഭിക്കുന്നത് രാജാസ് ഹൈസ്കൂള്‍ സ്ഥാപിച്ചതോടെയാണ് .1920-ലാണ് സ്ക്കൂളിന് അംഗീകാരം ലഭിച്ചത്. ആദ്യത്തെ എസ്.എസ്.എല്‍.സി.ബാച്ച് 1923 ല്‍ പഠിച്ചിറങ്ങി.ആദ്യ കാലത്ത് കോവിലകം പ്രൈമറി സ്കൂളില്‍ നിന്നും പഠിച്ചു വരുന്ന കുട്ടികള്‍ക്ക് ഇവിടെ നേരിട്ട് ചേരാം അല്ലാത്ത്വര്‍ക്ക് ഒരു ടെസ്റ്റ് നടത്തും അതായിരുന്നു വഴക്കം. കുഞ്ഞിക്കുട്ടന്‍ തമ്പുരാന്‍റെ സ്വാലനായിരുന്ന കെ. സി വീര രായന്‍ രാജാ ആയിരുന്നു ആദ്യത്തെ ഹെഡ് മാസ്റ്റര്‍. പിന്നീട് സംസ്കൃത പണ്ഡിതനായിരുന്ന രൈരുനായര്‍. സര്‍വ്വശ്രീ ബാലകൃഷ്ണ അയ്യര്‍, വിശ്വനാഥ അയ്യര്‍,കെ.സി.യു. രാജാ തുടങ്ങി പ്രഗത്ഭരായ അദ്ധ്യപകരുടെ മേല്‍ നോട്ടത്തില്‍ ഈ വിദ്യാലയം അനുദിനം വളര്‍ന്നു . കോഴിപ്പുറത്ത് മാധവമേനോന്‍ മദിരാശി സര്‍ക്കാരില്‍ മന്തിയായിരുന്നപ്പോള്‍ രാജാസ് ഹൈസ്കൂളിന് മെയിന്റനന്‍സ് ഗ്രാന്റിന്റെ സ്ഥാനത്ത് ബില്‍ഡിങ് ഗ്രാന്റ് നല്‍കാന്‍ ഉത്തരവിട്ടിരുന്നു .1973 ല്‍ ഇത് നിറുത്തലാക്കി.കൂടാതെ 1958 മുതല്‍ വാങ്ങിയ തുക 10000 ഉടന്‍ തിരിച്ചടക്കണമെന്നും ഉത്തരവായി .പ്രവേശനത്തിനും നിയമനത്തിനും പണം വാങ്ങിക്കുന്ന സ്ഥാപനമല്ലാത്തതിനാല്‍ ഈ സാഹചര്യത്തില്‍ സ്കൂള്‍ തുടര്‍ന്നു പ്രവര്‍ത്തിക്കുന്നതല്ല എന്നും മാനേജ്‌മെന്റ് നോട്ടീസ് ഇട്ടു. കോട്ടക്കലിന്റെ സാംസ്കാരിക ചരിത്രത്തില്‍ അവിസ്മരണീയമായ രാജാസ് ഹൈസ്കൂള്‍ പൂട്ടിപ്പോവുക സങ്കല്‍പ്പിക്കാന്‍ കഴിയുന്ന കാര്യമല്ലായിരുന്നു. ഇൗ സമയത്ത് വിദ്യാഭ്യാസ മന്ത്രിയായിരുന്ന ബീരാന്‍സാഹിബിന്റെ ശ്രമം മൂലം 5വര്‍ഷത്തേക്ക് സര്‍ക്കാര്‍ ഏറ്റെടുത്തു.ആ കാലാവധി കഴിഞ്ഞപ്പോള്‍ അന്നത്തെ സ്പോര്‍ട്ട്സ് മന്ത്രിയായിരുന്ന ശ്രീ .കെ.സി ഷണ്‍മുഖദാസ് ആണ് ഗവര്‍മെന്റ് ആനുവദിച്ച രണ്ട് സ്പോര്‍ട്ട്സ് സ്കൂളുകളുടെ സ്‌കീമില്‍ഉള്‍പ്പെടുത്തി 1978 ല്‍ രാജാസ് ഹൈസ്കൂളിന്റെ സ്ഥലം അക്വയര്‍ ചെയ്ത് വില നിശ്ചയിച്ച് ഗവര്‍മെന്റിലേക്ക് ഏറ്റെടുത്തത്. 1999-ല്‍ ഹയര്‍ സെക്കന്‍ററിയായി ഉയര്‍ത്തപ്പെട്ടു. ഇന്ന് എല്ലാ മേഖലകളിലും വിദ്യാലയം പഴയ പാരമ്പര്യവുമായി മുന്നോട്ടു പൊയ്ക്കൊണ്ടിരിക്കുന്നു.
            </p>
        </div>
        <div class="col-md-3 newsblock">
            <div class="aboutnewsblock"></div>
            <div class="well">
                <div class="page-header">
            <h2>News & Events</h2>
            </div>
      
              <marquee direction="up" scrolldelay="100">
                <?php
                $sql="SELECT * FROM news ";
                $result=mysqli_query($db,$sql)or die(mysqli_error());
                while($row=mysqli_fetch_array($result)){
                echo "<h3>".$row['heading']."</h3>";
                echo "<h5>".$row['info']."</h5>";
                echo "-----------------------------------------------------------------------";
                }
                ?>
              </marquee>
      
              <a href="news.php" align="right">Read More</a>
              </div>
  </div>
    </div>
</div>
<?php
include("footer.php");
?>